## 迭代，统计函数，排序，删除列

In [1]:
import numpy as np
import pandas as pd

## 序列与数据框的迭代

* 基于python的数据分析通常都希望通过函数完成对多个元素的操作，而避免直接通过python的循环来进行运算，这主要是考虑到python循环效率不高，通常函数底层都用c实现的循环。

* 但是有时确实要做一些非常特殊的统计必须要通过python进行循环。

In [2]:
df=pd.DataFrame({"a":["i","j","k","i","j","k"],"b":[2,1,4,1,2,4],"c":[3,2,2,1,2,3]})
df

   a  b  c
0  i  2  3
1  j  1  2
2  k  4  2
3  i  1  1
4  j  2  2
5  k  4  3

In [3]:
for i in df.iteritems():#列迭代
    print(i[1])

0    i
1    j
2    k
3    i
4    j
5    k
Name: a, dtype: object
0    2
1    1
2    4
3    1
4    2
5    4
Name: b, dtype: int64
0    3
1    2
2    2
3    1
4    2
5    3
Name: c, dtype: int64

In [4]:
for i in df.iterrows():#行迭代
    print(i[1])

a    i
b    2
c    3
Name: 0, dtype: object
a    j
b    1
c    2
Name: 1, dtype: object
a    k
b    4
c    2
Name: 2, dtype: object
a    i
b    1
c    1
Name: 3, dtype: object
a    j
b    2
c    2
Name: 4, dtype: object
a    k
b    4
c    3
Name: 5, dtype: object

In [5]:
for i in df.a.iteritems():#序列的迭代
    print(i[1])

i
j
k
i
j
k

### classwork1

* 请对df进行列迭代输出所有列的值
* 请对df进行行迭代输出每行的b列元素与c列元素
* 请输出df.b列元素与对应df.c的元素相加大于五的行
* 请通过迭代求出df.c列所有值之和

['i' 'j' 'k' 'i' 'j' 'k']
[2 1 4 1 2 4]
[3 2 2 1 2 3]

2 3
1 2
4 2
1 1
2 2
4 3

a    k
b    4
c    2
Name: 2, dtype: object
a    k
b    4
c    3
Name: 5, dtype: object

13

## 数据框常用统计函数及其方向性


* 统计函数：平均（mean）,求和（sum），最大值(max)，最小值(min)，中位数(median)，方差（var），标准差（std），累乘（prod），first,last,mean,median（中位数）,mad（均值绝对偏差）

* describe

* 方向性（axis）

In [6]:
data = {'high':[175, 167, 170, 180],'Age':[28,34,29,42],"Weight":[98,88,106,120]}# creat a DataFrame by dict
df1 = pd.DataFrame(data,index=["Tom","Jack","Steve","Ricky"])
print(df1)

       high  Age  Weight
Tom     175   28      98
Jack    167   34      88
Steve   170   29     106
Ricky   180   42     120

In [16]:
df1.mean()#记得括号,默认列统计

high      173.00
Age        33.25
Weight    103.00
dtype: float64

In [8]:
df1.high.mean()

173.0

In [9]:
df1.mean(axis=1)#可以选择行统计，但是通常无意义

Tom      100.333333
Jack      96.333333
Steve    101.666667
Ricky    114.000000
dtype: float64

In [10]:
df1.describe()#集成统计

             high        Age      Weight
count    4.000000   4.000000    4.000000
mean   173.000000  33.250000  103.000000
std      5.715476   6.396614   13.515423
min    167.000000  28.000000   88.000000
25%    169.250000  28.750000   95.500000
50%    172.500000  31.500000  102.000000
75%    176.250000  36.000000  109.500000
max    180.000000  42.000000  120.000000

In [11]:
df1.agg(["min","max","std"])#通过agg 能自定义统计哪些量

           high        Age      Weight
min  167.000000  28.000000   88.000000
max  180.000000  42.000000  120.000000
std    5.715476   6.396614   13.515423

## classwork 2

1，已知如下矩阵，注意其定义方式。

2，求上面数据框每列与每行的平均值

3，求第2列的和

4，求出每列的中位数

5，通过agg同时求出每列的均值，方差，中位数

6，使用describe函数求出各个分位数

7， 请读入t_alibaba_data3.txt数据。请输出数据的总行数,输出记录对应最大日期与最小日期

In [14]:
aj=np.array([[8, 4, 3, 4],
       [5, 7, 4, 3],
       [5, 3, 4, 7],
       [7, 7, 5, 8],
       [5, 4, 4, 5],
       [7, 5, 7, 6]])
ai=pd.DataFrame(aj,columns=["a","b","c","d"])#已知值，定义列表

In [15]:
ai.median()

a    6.0
b    4.5
c    4.0
d    5.5
dtype: float64

In [18]:
ai.agg(["mean","var","median"])

               a    b    c    d
mean    6.166667  5.0  4.5  5.5
var     1.766667  2.8  1.9  3.5
median  6.000000  4.5  4.0  5.5

In [19]:
ai.describe()

              a        b         c         d
count  6.000000  6.00000  6.000000  6.000000
mean   6.166667  5.00000  4.500000  5.500000
std    1.329160  1.67332  1.378405  1.870829
min    5.000000  3.00000  3.000000  3.000000
25%    5.000000  4.00000  4.000000  4.250000
50%    6.000000  4.50000  4.000000  5.500000
75%    7.000000  6.50000  4.750000  6.750000
max    8.000000  7.00000  7.000000  8.000000

In [ ]:
s=0
r1=pd.read_csv(r:"C:\Users\Admin\Desktop\t_alibaba_date3.txt",names=["user","brand","behavr","date"],sep="\t")
for i in r1.iteritems():#列迭代
    s+=1
print(s)
df1.date.max()
df1.date.min()

## 排序

* sort_values(by)
* sort_index

In [20]:
a1=pd.Series([2,3,6,1],index=["i","u","2","1"])#排序需要在同种类型的数据中进行（比如整数与字符就不能比较）
a1

i    2
u    3
2    6
1    1
dtype: int64

In [46]:
a1.sort_values()

1    1
i    2
u    3
2    6
dtype: int64

In [47]:
a1.sort_index()

1    1
2    6
i    2
u    3
dtype: int64

In [48]:
df1

       high  Age  Weight
Tom     175   28      98
Jack    167   34      88
Steve   170   29     106
Ricky   180   42     120

In [50]:
df1.sort_values(by="high")

       high  Age  Weight
Jack    167   34      88
Steve   170   29     106
Tom     175   28      98
Ricky   180   42     120

In [51]:
df1.sort_index()

       high  Age  Weight
Jack    167   34      88
Ricky   180   42     120
Steve   170   29     106
Tom     175   28      98

## 删除列

In [52]:
df1

       high  Age  Weight
Tom     175   28      98
Jack    167   34      88
Steve   170   29     106
Ricky   180   42     120

In [53]:
df1.drop(columns=["high"])

       Age  Weight
Tom     28      98
Jack    34      88
Steve   29     106
Ricky   42     120

In [54]:
df1.drop(index=["Tom"])

       high  Age  Weight
Jack    167   34      88
Steve   170   29     106
Ricky   180   42     120

In [56]:
df1.drop(index=["Jack","Steve"])

       high  Age  Weight
Tom     175   28      98
Ricky   180   42     120

## Classwork3

1, 请读入t_alibaba_data3.txt数据，并按照日期进行排序并输出其中brand,behavr两列

2，请删除behavr这列

In [57]:
r1=pd.read_csv(r:"C:\Users\Admin\Desktop\t_alibaba_date3.txt",names=["user","brand","behavr","date"],sep="\t")
r1.head()

       user  brand  behavr   date
0  10944750  13451       0  06/04
1  10944750  13451       2  06/04
2  10944750  13451       2  06/04
3  10944750  13451       0  06/04
4  10944750  13451       0  06/04

In [59]:
r1.sort_values(by="date")
r1.drop(columns=["user","date"])

        brand  behavr
101382   5185       0
108631   1031       0
108632   1031       0
108633   1031       0
58491   11776       0
...       ...     ...
152060   6118       0
152063   8187       0
172838    799       0
172824   3228       0
158236  22027       0

[182880 rows x 2 columns]

            user  brand   date
0       10944750  13451  06/04
1       10944750  13451  06/04
2       10944750  13451  06/04
3       10944750  13451  06/04
4       10944750  13451  06/04
...          ...    ...    ...
182875    847750  26631  07/30
182876    847750  26631  07/30
182877    847750   2845  08/12
182878    847750   5317  08/08
182879    847750  22353  08/08

[182880 rows x 3 columns]